
#///////////////////////////////////file 

#a=open('MHMSM86.txt')#اگر فایلی را که می خواستید باز کنید در کار خود فایل پروژه بود دیگر نیازی به ادرس  کامل نیست 

#'a'==append
#'w'==write
#'r'==read
#در صورت مشخص نکردن به صورت پیش ورز  روی خواندن 
try:
    a=open('MHMSM86.txt','a')
finally:
    a.close()

#///////////////////////////////روش خیلی بهتر 
# به جای 
#try
#ecxept


with open('MHMSM86.txt') as f :
     
    print(f.name)
    print(f.mode) 
   
    #(f.read())#نکته خیلی مهم از این متد استفاده نشود چون همه خط ها را به سرعت وارد رم می کند امکان کم آ»دن رم زیاد است به جاش از 
  
    print(f.readlines())#خیییییییییییلییییییییییی بهتر است  و درقالب لیست نشان می مدهد 

    print(f.readline())#فقط یک خط می خواند 

    #print(f.read(5))#خواندن 5 کاراتکتر 
    f.seek(10)#محل نشانگر موس در فایل باز شده در اینجا کاراکتر 10 است 
#مشابه کد بالا عمل میکند و دیگر نیازی به بستن بستن هم وجود ندارد اما در بالا اگر فراموش شود بد است 

with open('a.txt','w',encoding='Utf-8')as v :# استفاده می کنیم ساخته میشود  w  خب این فایل وجوذ ندارد اما چون ما داریم از مود 
    v.write('i love you god')
    v.seek(50)
    v.write('i love you MSM')
    v.seek(80)
    v.write('بسم الله الرحمن الرحیم')

 #اگر خواستید فارسی بنویسید encoding = utf-8قرار دهید   






























 




 
    
        
    


   